








sentence = "+緑@みどり@ミドリ@翠@美土里@見取@水鳥@翆@碧@美鳥@みドリ@美登里@見どり@覧どり@三十里@実取@緑里@美鳥@みドリ@未鳥@魅鳥@綠@midori@ﾐﾄﾞﾘ@Ｍｉｄｏｒｉ@Midori@MIDORI@ＭＩＤＯＲＩ@midori@みど@ミド@水土@見ど@観ど@診ど@視ど@看ど@觀ど@見ど@覧ど@覽ど@みと@水戸@御津@三戸@三和@弥刀@実と@ミト@美都@三登@美兎@弥都@未途@mido@MIDO@ｍｉｄｏ@Mido@Ｍｉｄｏ@mid@ミッド@みっど@ﾐｯﾄﾞ@ミット@mid@Mid@MID@ＭＩＤ@ｍｉｄ@Ｍｉｄ@みっと@見っと@見るぞ@グリーン@ぐりーん@グリーん@クリーン@くりーん@GReeeeN*"
print()
print(sentence)
print()
sentence = sentence.encode()
# sentence = sentence.decode()
print("-----------------------------------------------------------------------")
print()
print(sentence)
print()
print("-----------------------------------------------------------------------")
