class key_words_box_class:
    def key_words_box(self, field):
        key_words = ""

        if (field == "ghost"):
            key_words = "+お化け@おばけ@霊@幽霊@妖怪@溶解@容喙@養会@容解@ゼロ@ZERO@広角@降格@口角@高角@香格@甲殻@光角@高閣@甲賀区@白@城@Zero@無@ゴースト@亡霊@ハム@考案@公安警察@公安部@外事課@外事@障害者@ガイジ@館長@官庁@艦長@浣腸@干潮@管長@完調@間諜@攻殻機動隊@無し@なし@梨@成し@為し@作業@さ行@サ行@さぎょう@サギョウ@シロ@行動確認@zero@ZERO@知床@0*"
        elif (field == "stone"):
            key_words = "+石@医師@意思@意志@遺志@SixTONES@STONE@山口@春@貼る@貼@張る@張@ハル@波留@治@基地@吉@既知@機知@機智@貴地@キチ@きち@絆@織田@小田@尾田@オダ@おだ@誠@井上@井ノ上@イノウエ@くにお@邦夫@邦男@国男@國士@国士@肉@お肉@おにく*"
        elif (field == "dice"):
            key_words = "+サイコロ@コナン@メガネ@工藤@駆動@宮藤@久藤@狗堂@くどう@野村@のむら@ノムラ@乃村@埜村@能村@悟る@さとる@覚@悟@智@覚る@サトル@聡@覺@田上@田ノ上@田之上@たのうえ@タノウエ@田の上@田野上@ふみお@文雄@文夫@文男@文郎@フミオ@文緒@文生@文大@エ@工*"
        elif (field == "kaidan"):
            key_words = "+階段@会談@怪談@戒壇@解団@カイダン@怪男@快談@快段@猪名川@稲川@伊奈川@伊南川@伊那側@伊那川@いながわ@イナガワ@伊那@いな@否@イナ@居な@位な@鯔@胃な@17@辛い@つらい@ツライ@ツラい@からい@カライ@辛ラーメン@ラーメン二郎@次郎@二郎@じろう@痔瘻@治郎@ジロウ@次朗@二朗@清田@キヨタ@きよた@清た@浄た@清太@着よた@キヨタ@キヨ@喜代た@毀誉た@清水@清水次郎長@次郎長@泥水@順次@準じ@じゅんじ@殉じ@淳二@純次@淳司@準じ@順治@潤二*"
        elif (field == "house"):
            key_words = "+住吉@すみよし@炭よし@住みよし@清代氏@済みよし@すみよ氏@住み良し@純代氏@吉住@良純@よしずみ@佳純@美澄@義澄@吉積@吉住@義純@佳純@住み@済@炭@済@隅@スミ@墨@角@すみ@酸味@住@須美@澄@酸み*"
        elif (field == "quake"):
            key_words = "+地震@揺れ@震度@マグニチュード*"

        return key_words
